window.BASE_STATIONS = [
  {
    "id": "base-1",
    "seq": 1,
    "district": "浦东新区",
    "name": "洋泾街道暖洋服务中心（阳光基地）",
    "address": "博山路51弄40号",
    "people": 7,
    "lat": 31.245209,
    "lng": 121.55668
  },
  {
    "id": "base-2",
    "seq": 2,
    "district": "浦东新区",
    "name": "三林镇残疾人服务中心（阳光基地）",
    "address": "东书房路629弄8号409室",
    "people": 11,
    "lat": 31.162748,
    "lng": 121.537962
  },
  {
    "id": "base-3",
    "seq": 3,
    "district": "浦东新区",
    "name": "浦兴路街道阳光职业 康复援助中心",
    "address": "东陆路1456弄63号",
    "people": 24,
    "lat": 31.266079,
    "lng": 121.600022
  },
  {
    "id": "base-4",
    "seq": 4,
    "district": "浦东新区",
    "name": "陆家嘴街道阳光职业 康复援助中心",
    "address": "崂山五村555号",
    "people": 17,
    "lat": 31.2369,
    "lng": 121.516678
  },
  {
    "id": "base-5",
    "seq": 5,
    "district": "静安区",
    "name": "上海静安区江宁路街道残疾人服务社（阳光基地）",
    "address": "常德路1059号",
    "people": 16,
    "lat": 31.23725,
    "lng": 121.440718
  },
  {
    "id": "base-6",
    "seq": 6,
    "district": "静安区",
    "name": "上海市静安区共和新路街道残疾人服务社（阳光基地）",
    "address": "共和新路1725弄30号",
    "people": 1,
    "lat": 31.271187,
    "lng": 121.456282
  },
  {
    "id": "base-7",
    "seq": 7,
    "district": "静安区",
    "name": "上海市静安区彭浦新村街道残疾人服务社（阳光基地）",
    "address": "平顺路875弄17号",
    "people": 86,
    "lat": 31.319309,
    "lng": 121.455
  },
  {
    "id": "base-8",
    "seq": 8,
    "district": "长宁区",
    "name": "新华路街道阳光职业康复援助中心",
    "address": "法华镇路751弄13号",
    "people": 7,
    "lat": 31.207106,
    "lng": 121.422012
  },
  {
    "id": "base-9",
    "seq": 9,
    "district": "长宁区",
    "name": "北新泾街道阳光职业康复援助中心",
    "address": "天山西路350弄55号",
    "people": 24,
    "lat": 31.218565,
    "lng": 121.36503
  },
  {
    "id": "base-10",
    "seq": 10,
    "district": "长宁区",
    "name": "仙霞新村街道阳光职业康复援助中心",
    "address": "水城路453号",
    "people": 13,
    "lat": 31.207795,
    "lng": 121.390414
  },
  {
    "id": "base-11",
    "seq": 11,
    "district": "普陀区",
    "name": "甘泉路街道阳光职业康复援助中心",
    "address": "平利路41弄17号",
    "people": 9,
    "lat": 31.260862,
    "lng": 121.433305
  },
  {
    "id": "base-12",
    "seq": 12,
    "district": "普陀区",
    "name": "石泉路街道阳光职业康复援助中心",
    "address": "中山北路2627弄9号",
    "people": 9,
    "lat": 31.244001,
    "lng": 121.422204
  },
  {
    "id": "base-13",
    "seq": 13,
    "district": "普陀区",
    "name": "真如镇街道阳光职业康复援助中心",
    "address": "真北路1875弄59号",
    "people": 27,
    "lat": 31.250441,
    "lng": 121.389234
  },
  {
    "id": "base-14",
    "seq": 14,
    "district": "普陀区",
    "name": "桃浦镇阳光职业康复援助中心",
    "address": "郁李路80号",
    "people": 15,
    "lat": 31.283208,
    "lng": 121.34638
  },
  {
    "id": "base-15",
    "seq": 15,
    "district": "虹口区",
    "name": "北外滩街道阳光职业康复援助中心",
    "address": "峨眉路366弄13号",
    "people": 75,
    "lat": 31.264917,
    "lng": 121.504994
  },
  {
    "id": "base-16",
    "seq": 16,
    "district": "虹口区",
    "name": "江湾镇街道阳光职业康复援助中心",
    "address": "万安路927号",
    "people": 37,
    "lat": 31.300986,
    "lng": 121.47375
  },
  {
    "id": "base-17",
    "seq": 17,
    "district": "虹口区",
    "name": "曲阳路街道阳光职业康复援助中心",
    "address": "大连西路230弄17号",
    "people": 21,
    "lat": 31.279049,
    "lng": 121.490106
  },
  {
    "id": "base-18",
    "seq": 18,
    "district": "虹口区",
    "name": "四川北路街道阳光职业康复援助中心",
    "address": "武进路255号",
    "people": 13,
    "lat": 31.252114,
    "lng": 121.485785
  },
  {
    "id": "base-19",
    "seq": 19,
    "district": "杨浦区",
    "name": "大桥街道残疾人服务社（阳光基地）",
    "address": "临青路188号A3幢2楼",
    "people": 43,
    "lat": 31.264659,
    "lng": 121.54315
  },
  {
    "id": "base-20",
    "seq": 20,
    "district": "杨浦区",
    "name": "平凉路街道残疾人服务社（阳光基地）",
    "address": "杨浦区惠民路702号",
    "people": 43,
    "lat": 31.258298,
    "lng": 121.521521
  },
  {
    "id": "base-21",
    "seq": 21,
    "district": "杨浦区",
    "name": "四平路街道残疾人服务社（阳光基地）",
    "address": "杨浦区控江路2026弄9号",
    "people": 29,
    "lat": 31.27394,
    "lng": 121.510096
  },
  {
    "id": "base-22",
    "seq": 22,
    "district": "杨浦区",
    "name": "殷行街道残疾人服务社（阳光基地）",
    "address": "殷行一村29号",
    "people": 77,
    "lat": 31.326383,
    "lng": 121.542876
  },
  {
    "id": "base-23",
    "seq": 23,
    "district": "宝山区",
    "name": "上海市宝山区友谊路街道残疾人服务社",
    "address": "密山路42号",
    "people": 27,
    "lat": 31.402562,
    "lng": 121.48411
  },
  {
    "id": "base-24",
    "seq": 24,
    "district": "宝山区",
    "name": "上海市宝山区顾村镇残疾人服务社",
    "address": "菊太路1535号",
    "people": 33,
    "lat": 31.345406,
    "lng": 121.350612
  },
  {
    "id": "base-25",
    "seq": 25,
    "district": "宝山区",
    "name": "上海市宝山区大场镇残疾人服务社",
    "address": "上大路1358号东侧2楼",
    "people": 33,
    "lat": 31.310643,
    "lng": 121.38327
  },
  {
    "id": "base-26",
    "seq": 26,
    "district": "宝山区",
    "name": "上海市宝山区庙行镇残疾人服务社",
    "address": "共康八村52号二楼",
    "people": 17,
    "contact": "桑晔",
    "phone": "13817354616",
    "lat": 31.32359,
    "lng": 121.432239,
    "workSample": {
      "product": "茶渣有机肥分装",
      "quantity": "20KG（2000袋）",
      "company": "霸王茶姬",
      "issueDate": "2026年5月8日",
      "deliveryDate": "2026年5月23日",
      "progress": "80%"
    }
  },
  {
    "id": "base-27",
    "seq": 27,
    "district": "宝山区",
    "name": "上海市宝山区高境镇残疾人服务社",
    "address": "殷高路21弄2号",
    "people": 20,
    "lat": 31.322135,
    "lng": 121.490528
  },
  {
    "id": "base-28",
    "seq": 28,
    "district": "闵行区",
    "name": "上海闵行区浦江阳光职业康复援助中心",
    "address": "浦江镇叶家桥路283号",
    "people": 24,
    "lat": 31.063643,
    "lng": 121.529051
  },
  {
    "id": "base-29",
    "seq": 29,
    "district": "嘉定区",
    "name": "外冈镇残疾人服务社",
    "address": "仙居弄23号",
    "people": 2,
    "lat": 31.348229,
    "lng": 121.150076
  },
  {
    "id": "base-30",
    "seq": 30,
    "district": "嘉定区",
    "name": "南翔镇残疾人服务社",
    "address": "南翔镇裕丰路201弄6号",
    "people": 7,
    "lat": 31.296952,
    "lng": 121.309356
  },
  {
    "id": "base-31",
    "seq": 31,
    "district": "嘉定区",
    "name": "安亭镇阳光基地",
    "address": "博园路4800号",
    "people": 9,
    "lat": 31.264578,
    "lng": 121.217164
  },
  {
    "id": "base-32",
    "seq": 32,
    "district": "嘉定区",
    "name": "真新街道残疾人服务社",
    "address": "丰江路188弄52号边门 （栅桥小区）",
    "people": 7,
    "lat": 31.254832,
    "lng": 121.350217
  },
  {
    "id": "base-33",
    "seq": 33,
    "district": "嘉定区",
    "name": "嘉定镇街道残疾人服务社",
    "address": "塔城路560号A楼",
    "people": 16,
    "lat": 31.37585,
    "lng": 121.245656
  },
  {
    "id": "base-34",
    "seq": 34,
    "district": "金山区",
    "name": "金山卫镇阳光职业康复援助中心",
    "address": "板桥西路2155弄9号",
    "people": 9,
    "lat": 30.725358,
    "lng": 121.3075
  },
  {
    "id": "base-35",
    "seq": 35,
    "district": "金山区",
    "name": "亭林镇阳光职业康复援助中心",
    "address": "桃贤路28号",
    "people": 4,
    "lat": 30.882139,
    "lng": 121.320934
  },
  {
    "id": "base-36",
    "seq": 36,
    "district": "金山区",
    "name": "吕巷镇阳光职业康复援助中心",
    "address": "南溪二村102号",
    "people": 3,
    "lat": 30.825165,
    "lng": 121.174559
  },
  {
    "id": "base-37",
    "seq": 37,
    "district": "金山区",
    "name": "石化街道阳光职业康复援助中心",
    "address": "海棠新村108号",
    "people": 15,
    "lat": 30.719807,
    "lng": 121.347521
  },
  {
    "id": "base-38",
    "seq": 38,
    "district": "金山区",
    "name": "高新区阳光职业康复 援助中心",
    "address": "亭朱公路585号",
    "people": 10,
    "lat": 30.862469,
    "lng": 121.334933
  },
  {
    "id": "base-39",
    "seq": 39,
    "district": "松江区",
    "name": "松江区岳阳阳光职业康复援助中心",
    "address": "荣乐中路120弄14幢60号",
    "people": 8,
    "lat": 31.018286,
    "lng": 121.231319
  },
  {
    "id": "base-40",
    "seq": 40,
    "district": "松江区",
    "name": "松江区永丰街道残疾人综合服务中心 （阳光基地）",
    "address": "真玉路18号",
    "people": 9,
    "lat": 31.000277,
    "lng": 121.212929
  },
  {
    "id": "base-41",
    "seq": 41,
    "district": "松江区",
    "name": "松江区中山街道爱心残疾人综合服务中心（阳光基地）",
    "address": "茸惠路758弄34号",
    "people": 2,
    "lat": 31.059507,
    "lng": 121.258523
  },
  {
    "id": "base-42",
    "seq": 42,
    "district": "松江区",
    "name": "松江车墩镇残疾人综合服务中心 （阳光基地）",
    "address": "长溇村2队",
    "people": 4,
    "lat": 30.971003,
    "lng": 121.287849
  },
  {
    "id": "base-43",
    "seq": 43,
    "district": "松江区",
    "name": "松江区佘山镇残疾人综合服务中心（阳光基地）",
    "address": "天马东街23号",
    "people": 3,
    "lat": 31.072538,
    "lng": 121.153197
  },
  {
    "id": "base-44",
    "seq": 44,
    "district": "松江区",
    "name": "松江区新浜镇残疾人综合服务中心（阳光基地）",
    "address": "旺兴路265号",
    "people": 7,
    "lat": 30.939465,
    "lng": 121.075946
  },
  {
    "id": "base-45",
    "seq": 45,
    "district": "青浦区",
    "name": "上海青浦区重固镇残疾人服务社（阳光基地）",
    "address": "芦花浜路29号",
    "people": 8,
    "lat": 31.201136,
    "lng": 121.194331
  },
  {
    "id": "base-46",
    "seq": 46,
    "district": "青浦区",
    "name": "上海青浦区盈浦街道残疾人服务社（阳光基地）",
    "address": "青赵路811号4号楼2楼",
    "people": 6,
    "lat": 31.152353,
    "lng": 121.103621
  },
  {
    "id": "base-47",
    "seq": 47,
    "district": "奉贤区",
    "name": "上海奉贤区希街阳光 职业康复援助中心",
    "address": "西渡街道马家宅路200号",
    "people": 6,
    "lat": 30.96829,
    "lng": 121.436429
  },
  {
    "id": "base-48",
    "seq": 48,
    "district": "奉贤区",
    "name": "上海奉贤区金欣阳光 职业康复援助中心",
    "address": "金海街道茂园路岚丰路口（阳光家园内）",
    "people": 4,
    "lat": 30.966979,
    "lng": 121.476313
  },
  {
    "id": "base-49",
    "seq": 49,
    "district": "崇明区",
    "name": "上海崇明建设镇建馨助残服务社（阳光基地）",
    "address": "建设镇镇中路235号",
    "people": 16,
    "lat": 31.656935,
    "lng": 121.454937
  },
  {
    "id": "base-50",
    "seq": 50,
    "district": "崇明区",
    "name": "上海崇明竖新镇春曦助残服务社（阳光基地）",
    "address": "团城公路1831号",
    "people": 15,
    "lat": 31.563222,
    "lng": 121.582428
  },
  {
    "id": "base-51",
    "seq": 51,
    "district": "崇明区",
    "name": "上海崇明向化镇德仁助残服务社（阳光基地）",
    "address": "齐南村阜西452号",
    "people": 30,
    "lat": 31.568752,
    "lng": 121.741147
  },
  {
    "id": "base-52",
    "seq": 52,
    "district": "崇明区",
    "name": "上海崇明横沙乡残疾人服务社（阳光基地）",
    "address": "横沙乡民星村1040号",
    "people": 19,
    "lat": 31.363798,
    "lng": 121.83466
  }
];
